# MySQL DataBase
## Exercise 1: 
Create a simple relational database using MySQL(https://www.mysql.com/) and connect it to Python.
___

In [21]:
#importing libraries
import mysql.connector
from mysql.connector import Error
import pandas as pd
import pymysql
import seaborn as sns
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings("ignore")

### We are going to use this Entity-Relationship Diagram to create our DataBase in MySQL
![Diagrama Entidad Relación 2](DER2.png "DER2 imagen")

## Command Query Lines:

### Creating DataBase:

CREATE database example;

___

### Use DataBase "example":

USE example;

___

### Create Table Clientes:

CREATE TABLE clientes (

id_cliente varchar(255),

nombre varchar (50),

direccion varchar (50),

telefono varchar (50),

mail varchar(80),

PRIMARY KEY (id_cliente)

); 

___

### Create Table "establecimiento":

CREATE TABLE establecimiento (

id_establecimiento varchar(255),

nombre varchar (50),

area varchar (50),

localizacion varchar(80),


PRIMARY KEY (id_establecimiento)
);

___

### Create Table "Trabajador":

CREATE TABLE trabajadores (

id_trabajador varchar(255),

nombre varchar (50),

id_establecimiento varchar (50),

localizacion varchar(80),

PRIMARY KEY (id_trabajador)

);

___

### Create Table "Ordenes":

CREATE TABLE ordenes (

id_orden varchar(255),

id_producto varchar (50),

id_establecimiento varchar (50),

id_trabajador varchar (50),

id_tipo_producto varchar (50),

id_cliente varchar (50),

fecha date,

cantidad int,

PRIMARY KEY (id_orden)

);

___

### Create Table "Producto":

CREATE TABLE producto (

id_producto varchar(255),

nombre varchar (50),

descripcion varchar (50),

id_tipo_producto varchar (50),

precio varchar (50),

PRIMARY KEY (id_producto)

);

___

### Create Table "Tipo Producto":

CREATE TABLE tipo_producto (

id_tipo_producto varchar(255),

id_producto varchar (50),

descripcion varchar (350),

PRIMARY KEY (id_tipo_producto)

);

### Insert some values in each table:

INSERT INTO `clientes` (`id_cliente`,`nombre`,`direccion`,`telefono`,`mail`)

VALUES

  ("XSL25OQP3RF","Neville Donaldson","Ap #682-7065 Aliquam Avenue","1-871-701-1875","libero.est@outlook.com"),

  ("DIY33HKV5BJ","Galvin Delacruz","Ap #207-3964 Ligula. Rd.","(586) 761-3630","congue.turpis@aol.edu"),

  ("ZRD59XNU1VN","Kelsey Larsen","Ap #692-5045 Blandit Av.","1-986-351-2361","cursus.vestibulum@hotmail.couk"),

  ("YNS75IPP1NF","Emmanuel Boone","8752 Malesuada St.","1-451-942-9662","quam.quis@yahoo.couk"),

  ("XCW84HIO7IT","Micah Stewart","4091 Mauris St.","(155) 751-0338","fusce.aliquet@hotmail.net");

___
  
  INSERT INTO `establecimiento` (`id_establecimiento`,`nombre`,`area`,`localizacion`)

VALUES

  ("EFE52UPF5QA","Amet Faucibus Ut PC","Iowa","Ap #845-8261 Tempor Ave"),

  ("XWJ89VNY8LX","Nisi Magna Limited","Wyoming","539-6014 Orci Av."),

  ("XBV12KWI2UG","Auctor Inc.","Tabasco","Ap #434-5980 Luctus St."),

  ("YSF61YRJ8KP","Euismod PC","Kujawsko-pomorskie","Ap #119-7283 Est Road"),

  ("WBW59BSR4RP","Non Dui PC","Imo","P.O. Box 731, 5900 Facilisis Ave");

___
  
  INSERT INTO `trabajadores` (`id_trabajador`,`nombre`,`id_establecimiento`,`localizacion`)

VALUES

  ("HKJ56UMR6VA","Zenaida Farmer","HRP39MKO3IF","East Region"),

  ("MBN28QMT8CV","Madeson Gonzalez","MXO29XES2UQ","Maharastra"),

  ("SIX33HHH5EC","Lane Alvarez","GHW82HHB4VV","Chernihiv oblast"),

  ("DMD30ROC5MM","Brett Mccullough","PSW45EVX9OK","Pernambuco"),

  ("YUG27TUI4YW","Lael Everett","MUD43RYV2JR","Quebec");

___
  
INSERT INTO `ordenes` (`id_orden`,`id_producto`,`id_establecimiento`,`id_trabajador`,`id_tipo_producto`,`id_cliente`,`fecha`,`cantidad`)

VALUES

  ("VDI13MHE2S",4800,1,"OTO82WR0UU","YCY4C9QC",9501,"2021-6-11",34),

  ("YXJ4VNT5G",1844,2,"GHT28N3TK","SIX59MJM5NT",6398,"2021-6-11",7),

  ("CNI42RL3QV",9674,3,"OWU05VWU2QW","ZN90HYJ5PC",9232,"2021-6-11",15),

  ("EIU54W5JP",6338,4,"TRWBZK5AN","WBS52HI3RX",9089,"2021-6-11",16),

  ("DBE97OF2WC",7248,5,"IGTMA1UE","PTO23XIH2YJ",3772,"2021-6-11",28);

___
  
  INSERT INTO `producto` (`id_producto`,`nombre`,`descripcion`,`id_tipo_producto`,`precio`)

VALUES

  ("331","Manitoba","Sed nulla","MFK15SOF3UM","724"),

  ("775","South Chungcheong","augue porttitor interdum. Sed auctor odio a purus.","YRR55XOF3LU","177"),

  ("184","Pskov Oblast","tempor arcu. Vestibulum","YOX68GBR8DY","169"),

  ("463","Limón","ipsum dolor","PFH56VTY1OQ","323"),

  ("766","Valle d'Aosta","dui lectus rutrum urna,","LCN86ODP4BR","825");

___
  
  INSERT INTO `tipo_producto` (`id_tipo_producto`,`id_producto`,`descripcion`)

VALUES

  ("331",8744,"Sed nulla"),

  ("775",4195,"augue porttitor interdum. Sed auctor odio a purus."),

  ("184",7364,"tempor arcu. Vestibulum"),

  ("463",6528,"ipsum dolor"),
  
  ("766",3955,"dui lectus rutrum urna,");

___

### Lets conect to our database using python:

In [32]:
#Lets connect to our database example:
database = mysql.connector.connect(
     host="localhost",
     user="root",
     password="****",
     database='example')

print(database)

cursor = database.cursor(buffered=True)

<mysql.connector.connection_cext.CMySQLConnection object at 0x126400160>

___

### Exercise 2:
Show that you can load some simple queries to a Pandas Dataframe.

In [34]:
#Select all columns from establecimiento Table and save to a pandas DataFrame variable:

Query= pd.read_sql_query('''SELECT * FROM establecimiento;''', database)

df_establecimiento = pd.DataFrame(Query, columns=['id_establecimiento', 'nombre', 'area', 'localizacion'])
df_establecimiento

,id_establecimiento,nombre,area,localizacion
0,EFE52UPF5QA,Amet Faucibus Ut PC,Iowa,Ap #845-8261 Tempor Ave
1,WBW59BSR4RP,Non Dui PC,Imo,"P.O. Box 731, 5900 Facilisis Ave"
2,XBV12KWI2UG,Auctor Inc.,Tabasco,Ap #434-5980 Luctus St.
3,XWJ89VNY8LX,Nisi Magna Limited,Wyoming,539-6014 Orci Av.
4,YSF61YRJ8KP,Euismod PC,Kujawsko-pomorskie,Ap #119-7283 Est Road